УТ_для_edt/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_Модуль_РаботаСКонтрагентами/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возможность дополнить структуру РеквизитыПроверкиКонтрагентов для формы справочника. 
//
// Параметры:
//  Форма  - УправляемаяФорма - форма, для которой дополняется структура РеквизитыПроверкиКонтрагентов.
//  НовыеРеквизиты  - Структура - структура, которая транслируется в реквизит формы РеквизитыПроверкиКонтрагентов.
//
Процедура ДополнитьРеквизитыФормыКонтрагент(Форма, НовыеРеквизиты) Экспорт
	
	Если CRM_Модуль_РаботаСКонтрагентамиКлиентСервер.CRM_ЭтоФормаПартнераКакКонтрагента(Форма) Тогда
		НовыеРеквизиты.ЮрФизЛицо = Форма.ЮрФизЛицо;
		Если НовыеРеквизиты.ПроверкаИспользуется Тогда
			НовыеРеквизиты.ЮрФизЛицо                 = Форма.ЮрФизЛицо;
			НовыеРеквизиты.ЭтоЮридическоеЛицо        = (Форма.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") 
			                                                            Или  Форма.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент"));
			НовыеРеквизиты.ЭтоИностранныйКонтрагент  = (Форма.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьРеквизитыФормыДляСозданияКонтрагента(Форма) Экспорт
	
	ДобавитьСоглашение = (Форма.ИмяФормы = "Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНовая");
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	Реквизит = Новый РеквизитФормы("Контрагент_Объект", Новый ОписаниеТипов("СправочникОбъект.Контрагенты"));
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	Если ДобавитьСоглашение Тогда
		Реквизит = Новый РеквизитФормы("Соглашение", Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами"));
		ДобавляемыеРеквизиты.Добавить(Реквизит);
	КонецЕсли;
		
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЦветРамки = Новый Цвет(221, 221, 221);
	
	Если ДобавитьСоглашение Тогда
		Элемент = Форма.Элементы.Найти("Соглашение");
		Если Элемент = Неопределено Тогда
			Элемент = Форма.Элементы.Вставить("Соглашение", Тип("ПолеФормы"),
				Форма.Элементы.Найти("ГруппаРеквизитыИнтересаПравая"), Форма.Элементы.Найти("РольВИнтересе"));
			Элемент.ПутьКДанным = "Соглашение";
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ЦветРамки = ЦветРамки;
			Элемент.Видимость = Ложь;
			Элемент.Заголовок = НСтр("ru = 'Соглашение'");
			
			НоваяСвязь = Новый СвязьПараметраВыбора("Партнер", "Клиент");
			МассивСвязей = Новый Массив();
			МассивСвязей.Добавить(НоваяСвязь);
			Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
			
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_СоглащениеПриИзменении");
		КонецЕсли;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("Контрагент_ОбъектЮрФизЛицо");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("Контрагент_ОбъектЮрФизЛицо", Тип("ПолеФормы"),
			Форма.Элементы.Найти("ГруппаРеквизитыКлиентаПравая"), Форма.Элементы.Найти("Клиент_ОбъектРодитель"));
		Элемент.ПутьКДанным = "Контрагент_Объект.ЮрФизЛицо";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.РежимВыбораИзСписка = Истина;
		Элемент.СписокВыбора.Добавить(Перечисления.ЮрФизЛицо.ЮрЛицо);
		Элемент.СписокВыбора.Добавить(Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент);
		Элемент.СписокВыбора.Добавить(Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель);
		Элемент.ЦветРамки = ЦветРамки;
		Элемент.Заголовок = НСтр("ru = 'Вид контрагента'");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаПартнеров") Тогда
		Элемент = Форма.Элементы.Найти("Клиент_ОбъектГруппаДоступа");
		Если Элемент = Неопределено Тогда
			Элемент = Форма.Элементы.Вставить("Клиент_ОбъектГруппаДоступа", Тип("ПолеФормы"),
				Форма.Элементы.Найти("ГруппаРеквизитыКлиентаПравая"), Форма.Элементы.Найти("Клиент_ОбъектРодитель"));
			Элемент.ПутьКДанным = "Клиент_Объект.ГруппаДоступа";
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ЦветРамки = ЦветРамки;
		КонецЕсли;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("Клиент_ОбъектCRM_КодПоОКПО");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить("Клиент_ОбъектCRM_КодПоОКПО", Тип("ПолеФормы"), Форма.Элементы.Найти("ГруппаКлиентИНН"));
		Элемент.ПутьКДанным = "Контрагент_Объект.КодПоОКПО";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ЦветРамки = ЦветРамки;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Валюта") Тогда
		Форма.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьКонтрагентаПриСозданииПартнера(Форма, Партнер) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Контрагент_Объект") Тогда
	
		ОбъектКонтрагент						= Форма.РеквизитФормыВЗначение("Контрагент_Объект");
		ОбъектКонтрагент.Партнер				= Партнер.Ссылка;
		ОбъектКонтрагент.Наименование			= Партнер.Наименование;
		ОбъектКонтрагент.НаименованиеПолное		= Партнер.НаименованиеПолное;
		
		ОбъектКонтрагент["ИНН"] = Форма.Клиент_ИНН;
		ОбъектКонтрагент["КПП"] = Форма.Клиент_КПП;
		
		Для Каждого Стр Из Партнер.КонтактнаяИнформация Цикл
			Если Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ОбъектКонтрагент, Стр.Значение, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, Перечисления.ТипыКонтактнойИнформации.Адрес);
				УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ОбъектКонтрагент, Стр.Значение, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, Перечисления.ТипыКонтактнойИнформации.Адрес);
			КонецЕсли;
		КонецЦикла;
			
		Попытка
			ОбъектКонтрагент.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЮрФизЛицоПриИзменении(Форма) Экспорт
	
	Если Форма.Клиент_Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
		Форма.Контрагент_Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		Форма.Элементы.Контрагент_ОбъектЮрФизЛицо.Видимость = Ложь;
	Иначе
		Форма.Контрагент_Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		Форма.Элементы.Контрагент_ОбъектЮрФизЛицо.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеКонтрагента(Форма, Отказ) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Клиент_Объект") Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаПартнеров") И НЕ ЗначениеЗаполнено(Форма.Клиент_Объект.ГруппаДоступа) Тогда
			ТекстСообщения = НСтр("ru='Не заполнена группа доступа клиента'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Клиент_Объект.ГруппаДоступа",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры// ПроверитьЗаполнениеКонтрагента(Форма, Отказ) Экспорт

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
